menu = [["Пицца Маргарита", ["мука", "томаты", "сыр", "базилик"], 10],
    ["Салат Цезарь", ["салат", "курица", "сыр", "сухарики"], 8],
    ["Суп Томатный", ["томаты", "лук", "морковь", "картофель"], 6]]
while True:
    print("""Команды: 
1. Отобразить меню
2. Найти блюдо
3. Добавить блюдо
4. Изменить цену
Любое др. число = выход""")
    n = int(input())
    if n == 1:
        for i in menu:
            print(f"{i[0]}|Состав:{", ".join(i[1])}|Цена:{i[2]}")
    elif n == 2:
        k = input("Введите название блюда: ")
        flag = 1
        for i in menu:
            if i[0].lower() == k.lower():
                print(f"{i[0]}|Состав:{" ".join(i[1])}|Цена:{i[2]}")
                flag = 0
        if flag:print("Такого блюда нет :(")
    elif n == 3:
        menu.append([input("Название: "), input("Состав(без запятых): ").split(),int(input("Цена: "))])
    elif n == 4:
        k = input("Введите название блюда: ")
        flag = 1
        for i in menu:
            if i[0].lower() == k.lower():
                i[2] = int(input("Введите новую цену: "))
                flag = 0
            if flag: print("Такого блюда нет :(")
    else:
        break
